app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2022-12-10 20:15:44.619423"], ["updated_at", "2022-12-10 20:15:44.619423"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?)  [["product_id", 6], ["cart_id", 1], ["created_at", "2022-12-10 21:21:50.987374"], ["updated_at", "2022-12-10 21:21:50.987374"], ["quantity", 1]]
UPDATE "line_items" SET "updated_at" = ?, "quantity" = ? WHERE "line_items"."id" = ?  [["updated_at", "2022-12-10 21:20:30.372429"], ["quantity", 2], ["id", 1]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save